# A191 Stock Factors 181-191

In [3]:
import dai
import pandas as pd
from a191_sql_base import get_a191_sql_base

In [4]:
sd = '2023-01-01'
ed = '2026-01-01'

## A191 Factor 181

Formula:

`SUM(((CLOSE/DELAY(CLOSE,1)-1)-MEAN((CLOSE/DELAY(CLOSE,1)-1),20))-(BANCHMARKINDEXCLOSE-MEAN(BANCHMARKINDEXCLOSE,20))^2,20)/SUM((BANCHMARKINDEXCLOSE-MEAN(BANCHMARKINDEXCLOSE,20))^3)`

In [5]:
sql_alpha_181 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(((close/m_lag(close,1)-1) -
           m_avg((close/m_lag(close,1)-1),20)) -
          (bm_close - m_avg(bm_close,20))^2,20) /
    m_sum((bm_close - m_avg(bm_close,20))^3,20)
    AS alpha_a191_f0181
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_181), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0181
203309  2023-03-07  000001.SZ         -0.026508
203310  2023-03-07  000002.SZ         -0.026508
203311  2023-03-07  000004.SZ         -0.026508
203312  2023-03-07  000005.SZ         -0.026508
203313  2023-03-07  000006.SZ         -0.026508
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -2.168623
3858341 2025-12-26  688800.SH         -2.168614
3858345 2025-12-26  688819.SH         -2.168617
3858346 2025-12-26  688981.SH         -2.168617
3858347 2025-12-26  689009.SH         -2.168625

[3462445 rows x 3 columns]

## A191 Factor 182

Formula:

`COUNT((CLOSE>OPEN & BANCHMARKINDEXCLOSE>BANCHMARKINDEXOPEN)OR(CLOSE<OPEN &BANCHMARKINDEXCLOSE<BANCHMARKINDEXOPEN),20)/20`

In [6]:
sql_alpha_182 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(
        IF((close > open AND bm_close > bm_open) OR
           (close < open AND bm_close < bm_open), 1, 0),
        20
    ) / 20
    AS alpha_a191_f0182
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_182), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0182
101438  2023-02-07  000001.SZ              0.75
101439  2023-02-07  000002.SZ              0.55
101440  2023-02-07  000004.SZ              0.70
101441  2023-02-07  000005.SZ              0.40
101442  2023-02-07  000006.SZ              0.60
...            ...        ...               ...
3858340 2025-12-26  688799.SH              0.70
3858341 2025-12-26  688800.SH              0.60
3858345 2025-12-26  688819.SH              0.75
3858346 2025-12-26  688981.SH              0.65
3858347 2025-12-26  689009.SH              0.55

[3568164 rows x 3 columns]

## A191 Factor 183

Formula:

`MAX(SUMAC(CLOSE-MEAN(CLOSE,24)))-MIN(SUMAC(CLOSE-MEAN(CLOSE,24)))/STD(CLOSE,24)`

In [7]:
sql_alpha_183 = f"""--sql
SELECT
    date,
    instrument,
    m_max(c_sum(close - m_avg(close,24)),24) -
    m_min(c_sum(close - m_avg(close,24)),24) /
    m_stddev(close,24)
    AS alpha_a191_f0183
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_183), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0183
239099  2023-03-16  000001.SZ      18128.908050
239100  2023-03-16  000002.SZ      17952.691819
239101  2023-03-16  000004.SZ      44397.841692
239102  2023-03-16  000005.SZ      93913.855290
239103  2023-03-16  000006.SZ      19709.011912
...            ...        ...               ...
3858340 2025-12-26  688799.SH      25006.164450
3858341 2025-12-26  688800.SH      14121.353166
3858345 2025-12-26  688819.SH      30377.543438
3858346 2025-12-26  688981.SH      16880.903676
3858347 2025-12-26  689009.SH      25602.350236

[3434398 rows x 3 columns]

## A191 Factor 184

Formula:

`(RANK(CORR(DELAY((OPEN -CLOSE), 1), CLOSE, 200)) + RANK((OPEN -CLOSE)))`

In [8]:
sql_alpha_184 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_corr(m_lag((open - close), 1), close, 200)) +
     c_pct_rank((open - close)))
    AS alpha_a191_f0184
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_184), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0184
1043019 2023-11-03  000001.SZ          1.824028
1043020 2023-11-03  000002.SZ          0.830204
1043022 2023-11-03  000005.SZ          1.540653
1043023 2023-11-03  000006.SZ          0.392427
1043025 2023-11-03  000008.SZ          0.584625
...            ...        ...               ...
3858340 2025-12-26  688799.SH          1.270581
3858341 2025-12-26  688800.SH          1.708443
3858345 2025-12-26  688819.SH          0.626493
3858346 2025-12-26  688981.SH          1.237277
3858347 2025-12-26  689009.SH          1.527505

[2620417 rows x 3 columns]

## A191 Factor 185

Formula:

`RANK((-1 * ((1 -(OPEN / CLOSE))^2)))`

In [9]:
sql_alpha_185 = f"""--sql
SELECT
    date,
    instrument,
    c_pct_rank((-1 * ((1 - (open / close)) ^ 2)))
    AS alpha_a191_f0185
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_185), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0185
5067    2023-01-04  000001.SZ          0.055930
5068    2023-01-04  000002.SZ          0.054501
5069    2023-01-04  000004.SZ          0.607471
5070    2023-01-04  000005.SZ          0.691366
5071    2023-01-04  000006.SZ          0.634619
...            ...        ...               ...
3858343 2025-12-26  688805.SH          0.052866
3858344 2025-12-26  688807.SH          0.011619
3858345 2025-12-26  688819.SH          0.333075
3858346 2025-12-26  688981.SH          0.776143
3858347 2025-12-26  689009.SH          0.065066

[3668803 rows x 3 columns]

## A191 Factor 186

Formula:

`(MEAN(ABS(SUM((LD>0 & LD>HD)?LD:0,14)*100/SUM(TR,14)-SUM((HD>0 & HD>LD)?HD:0,14)*100/SUM(TR,14))/(SUM((LD>0&LD>HD)?LD:0,14)*100/SUM(TR,14)+SUM((HD>0 & HD>LD)?HD:0,14)*100/SUM(TR,14))*100,6)+DELAY(MEAN(ABS(SUM((LD>0 &LD>HD)?LD:0,14)*100/SUM(TR,14)-SUM((HD>0 &HD>LD)?HD:0,14)*100/SUM(TR,14))/(SUM((LD>0 &LD>HD)?LD:0,14)*100/SUM(TR,14)+SUM((HD>0 &HD>LD)?HD:0,14)*100/SUM(TR,14))*100,6),6))/2`

In [10]:
sql_alpha_186 = f"""--sql
SELECT
    date,
    instrument,
    (m_lag(
        m_avg(
            abs(
                (m_sum(IF(LD > 0 AND LD > HD, LD, 0),14) * 100 / m_sum(TR, 14) -
                 m_sum(IF(HD > 0 AND HD > LD, HD, 0),14) * 100 / m_sum(TR, 14)) /
                (m_sum(IF(LD > 0 AND LD > HD, LD, 0),14) * 100 / m_sum(TR, 14) +
                 m_sum(IF(HD > 0 AND HD > LD, HD, 0),14) * 100 / m_sum(TR, 14))
            ),
            14
        ) * 100,
        6
    ) +
     m_lag(
        m_avg(
            abs(
                (m_sum(IF(LD > 0 AND LD > HD, LD, 0),14) * 100 / m_sum(TR, 14) -
                 m_sum(IF(HD > 0 AND HD > LD, HD, 0),14) * 100 / m_sum(TR, 14)) /
                (m_sum(IF(LD > 0 AND LD > HD, LD, 0),14) * 100 / m_sum(TR, 14) +
                 m_sum(IF(HD > 0 AND HD > LD, HD, 0),14) * 100 / m_sum(TR, 14))
            ),
            14
        ) * 100,
        6
    )) / 2
    AS alpha_a191_f0186
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_186), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0186
167595  2023-02-24  000001.SZ         28.767496
167596  2023-02-24  000002.SZ         39.522212
167597  2023-02-24  000004.SZ         36.864594
167598  2023-02-24  000005.SZ         38.889257
167599  2023-02-24  000006.SZ         31.765472
...            ...        ...               ...
3858340 2025-12-26  688799.SH         29.039477
3858341 2025-12-26  688800.SH         40.898619
3858345 2025-12-26  688819.SH         39.969584
3858346 2025-12-26  688981.SH         19.008113
3858347 2025-12-26  689009.SH          9.867696

[3499424 rows x 3 columns]

## A191 Factor 187

Formula:

`SUM((OPEN<=DELAY(OPEN,1)?0:MAX((HIGH-OPEN),(OPEN-DELAY(OPEN,1)))),20)`

In [11]:
sql_alpha_187 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(open <= m_lag(open, 1),
             0,
             greatest((high - open),
                      (open - m_lag(open, 1)))), 20)
    AS alpha_a191_f0187
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_187), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0187
101438  2023-02-07  000001.SZ        402.194824
101439  2023-02-07  000002.SZ        710.306724
101440  2023-02-07  000004.SZ          8.981135
101441  2023-02-07  000005.SZ          2.780281
101442  2023-02-07  000006.SZ         35.824385
...            ...        ...               ...
3858340 2025-12-26  688799.SH         17.582435
3858341 2025-12-26  688800.SH        118.117843
3858345 2025-12-26  688819.SH          5.500419
3858346 2025-12-26  688981.SH         35.860000
3858347 2025-12-26  689009.SH         11.479426

[3568164 rows x 3 columns]

## A191 Factor 188

Formula:

`((HIGH-LOW–SMA(HIGH-LOW,11,2))/SMA(HIGH-LOW,11,2))*100`

In [12]:
sql_alpha_188 = f"""--sql
SELECT
    date,
    instrument,
    ((high - low - m_ta_ewm(high - low,11,2)) /
     m_ta_ewm(high - low,11,2)) * 100
    AS alpha_a191_f0188
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_188), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0188
5067    2023-01-04  000001.SZ          0.000000
5068    2023-01-04  000002.SZ          0.000000
5069    2023-01-04  000004.SZ          0.000000
5070    2023-01-04  000005.SZ          0.000000
5071    2023-01-04  000006.SZ          0.000000
...            ...        ...               ...
3858343 2025-12-26  688805.SH        -37.732708
3858344 2025-12-26  688807.SH        -15.904438
3858345 2025-12-26  688819.SH         31.774284
3858346 2025-12-26  688981.SH          1.906828
3858347 2025-12-26  689009.SH         69.788944

[3668729 rows x 3 columns]

## A191 Factor 189

Formula:

`MEAN(ABS(CLOSE-MEAN(CLOSE,6)),6)`

In [13]:
sql_alpha_189 = f"""--sql
SELECT
    date,
    instrument,
    m_avg(abs(close - m_avg(close,6)),6)
    AS alpha_a191_f0189
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_189), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0189
55750   2023-01-18  000001.SZ         21.204795
55751   2023-01-18  000002.SZ         23.475263
55752   2023-01-18  000004.SZ          0.593775
55753   2023-01-18  000005.SZ          0.213670
55754   2023-01-18  000006.SZ          5.419087
...            ...        ...               ...
3858340 2025-12-26  688799.SH          1.209234
3858341 2025-12-26  688800.SH          6.577564
3858345 2025-12-26  688819.SH          0.528232
3858346 2025-12-26  688981.SH          3.922778
3858347 2025-12-26  689009.SH          1.054778

[3615806 rows x 3 columns]

## A191 Factor 190

Formula:

`LOG((COUNT(CLOSE/DELAY(CLOSE)-1>((CLOSE/DELAY(CLOSE,19))^(1/20)-1),20)-1)*(SUMIF(((CLOSE/DELAY(CLOSE)-1-(CLOSE/DELAY(CLOSE,19))^(1/20)-1))^2,20,CLOSE/DELAY(CLOSE)-1<(CLOSE/DELAY(CLOSE,19))^(1/20)-1))/((COUNT((CLOSE/DELAY(CLOSE)-1<(CLOSE/DELAY(CLOSE,19))^(1/20)-1),20))*(SUMIF((CLOSE/DELAY(CLOSE)-1-((CLOSE/DELAY(CLOSE,19))^(1/20)-1))^2,20,CLOSE/DELAY(CLOSE)-1>(CLOSE/DELAY(CLOSE,19))^(1/20)-1))))`

In [15]:
sql_alpha_190 = f"""--sql
SELECT
    date,
    instrument,
    (
        (
            m_sum(
                IF(
                    close / m_lag(close, 1) - 1 > (power(close / m_lag(close, 19), 1.0/20) - 1),
                    1,
                    0
                ),
                20
            ) - 1
        )
        *
        m_sum(
            IF(
                close / m_lag(close, 1) - 1 < (power(close / m_lag(close, 19), 1.0/20) - 1),
                power(
                    close / m_lag(close, 1) - 1 - (power(close / m_lag(close, 19), 1.0/20) - 1),
                    2
                ),
                0
            ),
            20
        )
    )
    /
    (
        m_sum(
            IF(
                close / m_lag(close, 1) - 1 < (power(close / m_lag(close, 19), 1.0/20) - 1),
                1,
                0
            ),
            20
        )
        *
        m_sum(
            IF(
                close / m_lag(close, 1) - 1 > (power(close / m_lag(close, 19), 1.0/20) - 1),
                power(
                    close / m_lag(close, 1) - 1 - (power(close / m_lag(close, 19), 1.0/20) - 1),
                    2
                ),
                0
            ),
            20
        )
    )
    AS alpha_a191_f0190
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_190), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0190
106518  2023-02-08  000001.SZ          0.000000
106520  2023-02-08  000004.SZ          0.000000
106521  2023-02-08  000005.SZ          0.000000
106523  2023-02-08  000007.SZ          0.000000
106524  2023-02-08  000008.SZ          0.000000
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.846034
3858341 2025-12-26  688800.SH          0.185649
3858345 2025-12-26  688819.SH          0.615864
3858346 2025-12-26  688981.SH          0.219341
3858347 2025-12-26  689009.SH          0.781300

[3559007 rows x 3 columns]

## A191 Factor 191

Formula:

`((CORR(MEAN(VOLUME,20), LOW, 5) + ((HIGH + LOW) / 2)) -CLOSE)`

In [16]:
sql_alpha_191 = f"""--sql
SELECT
    date,
    instrument,
    ((m_corr(m_avg(volume,20), low, 5) + ((high + low) / 2)) - close)
    AS alpha_a191_f0191
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_191), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0191
121771  2023-02-13  000001.SZ         -5.268537
121772  2023-02-13  000002.SZ        -34.912554
121773  2023-02-13  000004.SZ          0.203996
121774  2023-02-13  000005.SZ          0.391143
121775  2023-02-13  000006.SZ         -1.507964
...            ...        ...               ...
3858340 2025-12-26  688799.SH          1.230550
3858341 2025-12-26  688800.SH          3.740117
3858345 2025-12-26  688819.SH         -0.467506
3858346 2025-12-26  688981.SH          1.733417
3858347 2025-12-26  689009.SH          0.703191

[3546587 rows x 3 columns]